Autodesk.Revit.DB.IFCConfigurationUpgradeData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFCConfigurationUpgradeData.#ctor
Initializes the data with default values

Autodesk.Revit.DB.IFCConfigurationUpgradeData
Data wrapper for IFC configuration upgrade operations.